EDT/ZUP/zup_edt/src/InformationRegisters/КомментарииКандидатов/КомментарииКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <type>
      <types>EnumRef.ДоступностьКомментарияКандидата</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСкрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестоПубликации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/Enums/ДоступностьКомментарияКандидата/ДоступностьКомментарияКандидата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДоступностьКомментарияКандидата</name>
  <enumValues>
    <name>Общедоступный</name>
  </enumValues>
  <enumValues>
    <name>ТолькоДляАвтора</name>
  </enumValues>
</mdclass:Enum>

EDT/ZUP/zup_edt/src/InformationRegisters/КомментарииКандидатов/Forms/КомментарийКандидата/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СохранятьИзменения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	Если Запись.Доступность = Перечисления.ДоступностьКомментарияКандидата.ТолькоДляАвтора Тогда
		ТолькоДляАвтора = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначения.СсылкаСуществует(Запись.Пользователь) Тогда
		Заголовок = Строка(Запись.Пользователь);
	КонецЕсли;
	
	Если Запись.Пользователь <> Пользователи.АвторизованныйПользователь() Тогда
		ТолькоПросмотр = Истина;
		Элементы.ТолькоДляАвтора.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.МестоПубликации) Тогда
		Элементы.ИнформационнаяНадписьМестоПубликации.Видимость = Ложь;
	Иначе
		ТолькоПросмотр = Истина;
		Элементы.ИнформационнаяНадписьМестоПубликации.Видимость = Истина;
		Элементы.ИнформационнаяНадписьМестоПубликации.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Добавлен на сайте %1'"), 
			Запись.МестоПубликации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если СохранятьИзменения = Истина Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.Комментарий) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Комментарий не заполнен.'"), , , "Запись.Комментарий", Отказ);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Запись");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранятьИзменения = Истина;
	
	Если ТолькоДляАвтора Тогда
		Запись.Доступность = ПредопределенноеЗначение("Перечисление.ДоступностьКомментарияКандидата.ТолькоДляАвтора");
	Иначе
		Запись.Доступность = ПредопределенноеЗначение("Перечисление.ДоступностьКомментарияКандидата.Общедоступный");
	КонецЕсли;
	
	Закрыть(Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
